---
kind: other
id: Properties.T:Autodesk.Revit.DB.SweptProfile
source: html/620d8b22-8f75-7bc9-03e5-0d88969d3607.htm
---
# SweptProfile Properties

The distance from the end of the driving curve to the point where the sweep actually ends.